==================
Inline code with single backticks
==================

# USER

Foo `bar` baz

# ASSISTANT

Code `example` in text.

---

(source_file
  (user
    (user_header)
    (text)
    (code
      (code_content))
    (text))
  (assistant
    (assistant_header)
    (text)
    (code
      (code_content))
    (text)))

=======================
Inline code with double backticks
=======================

# ASSISTANT

`` `code` ``

More text after.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

===============================
Triple backticks no language
===============================

# ASSISTANT

```
multi
line
code
```

More text after.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

==============================
Triple backticks with language
==============================

# ASSISTANT

```python
def hello():
    print("world")
```

More text after.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

=========================================
Triple backticks with invalid language (has spaces)
=========================================

# ASSISTANT

```python stuff
def hello():
    print("world")
```

More text after.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

===============================
Quadruple backticks with language
===============================

# ASSISTANT

````rust
fn main() {
    println!("Hello with ``` inside");
}
````

More text after.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

===============================
Triple backticks inline with language
===============================

# ASSISTANT

```javascript console.log("hello")```

More text after.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

===============================
Triple backticks language with numbers and symbols
===============================

# ASSISTANT

```c++
#include <iostream>
```

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))

===============================
Empty code blocks
===============================

# ASSISTANT

`````
`````

More text.

---

(source_file
  (assistant
    (assistant_header)
    (code
      (code_content))
    (text)))
